<!--新闻页面-->
<template>
	<div class='tab-news'>		
		你好，我是新闻页面
		<ul>
			<li v-for='(item, index) in news'
				:key='index'
				:class='{ selected: id === index }'
				@click='id = index'>
				{{ item.title }}
			</li>
		</ul>
		
		<div class='news-content'>
			{{ currentContent }}
		</div>
	</div>	
</template>

<script>
export default {
	name: 'TabNews', 
	
	components: {
	},
	
	data() {
		return {
			id: 0,
			news: [{
				title: '索马里拜多阿市发生自杀式袭击 造成至少4人死亡',
				content: '当地时间10日，索马里西南部巴伊州拜多阿市的一家咖啡馆发生自杀式爆炸袭击，至少造成4人死亡，6人受伤。与基地组织有关联的极端组织索马里“青年党”宣称对此次袭击负责。当地媒体报道称，此次袭击目标是该州州长，但他没有在袭击中受伤。索马里政府谴责“青年党”武装分子对平民发动的袭击。拜多阿是索马里的主要城市之一，位于首都摩加迪沙西南约240公里处。（总台记者 杨琼）'
			}, {
				title: '延迟退休 配套措施如何完善',
				content: '“十四五”规划和2035年远景目标纲要明确提出，逐步延迟法定退休年龄。作为一项涉及社会方方面面的改革，可能带来哪些影响，记者采访了权威专家。延迟退休，将坚持小步调整原则有人认为，延迟退休意味着岗位减少，年轻人工作将更加难找。对此，中国劳动和社会保障科学研究院副院长莫荣表示，静态看，延迟退休会对就业产生一定冲击。劳动力供给增加，自然腾退的岗位减少，短期内大龄劳动者、灵活就业人员将面临更大的竞争压力。“但这种冲击是有限的、可控的，不会挤压年轻人的就业机会。”从劳动力供给端看，我国劳动年龄人口数量已连续8年下降，劳动参与率持续下降。“十四五”时期，我国人口老龄化进程仍将加剧，第二次出生高峰的人口（1962年至1972年）将进入老龄期，老年人口进一步增多，“一升一降”，在现有退休年龄政策不变的情况下，未来甚至可能会出现劳动力供给不足的情况。从劳动力结构看，大龄劳动者与青年人就业岗位的替代性不强。“青年人的就业问题，更多取决于经济发展的结构优化和质量提升，能否提供足够的、与青年人就业能力、意愿相匹配的岗位。”莫荣说，随着我国高质量发展加快推进，特别是新技术、新业态、新模式大量涌现，经济发展带动就业的能力不断增长，青年就业有广阔空间。'			
			}]
		};
	},
	
	computed: {
		currentContent() {
			return this.news[this.id].content;
		}
	},
	
	methods: {	
		/*************************/
	}
};
</script>

<style scoped src='./TabNews.less' lang='less'/>
<style scoped>
</style>
